# 2 Filtering data

In chapter 1, we have seen how to retrieve data with select. Now you may want to know how can we only retrieve the data that interest us,
but not all the rows. We can use the **where** statement to filter data that satisfied certain conditions.

In this chapter, we will use another database **weather_stations**, this database only have one table called **station_data**

In [1]:
%load_ext sql
%config SqlMagic.autocommit=False
%config SqlMagic.autolimit=20
%config SqlMagic.displaylimit=20
%sql postgresql://pliu:pliu@127.0.0.1:5432/weather_stations

In [3]:
%%sql
SELECT * from station_data limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

## 2.1 Filtering digit columns

To filter digit column, we need to build a boolean expression such as column_name comparator value

Possible comparators:
- equality : =
- inequality : !=, or <>
- greater than: >
- less than : <
- Greater than equal to : >=
- Less than equal to : <=

Below query is an example, in the boolean expression column name is year, comparator is =, value is 2010
This query should only return records where the year field equals to 2010

In [5]:
%%sql
select * from station_data where year=2010 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(719160, 'BAB974', 2010, 1, 22, Decimal('-22.80000000000000071'), Decimal('1014.2000000000000454'), None, Decimal('10.199999999999999289'), Decimal('-18.5'), Decimal('0'), Decimal('9.4000000000000003552'), 0, 0, 0, 0, 0),
 (766870, '7C0938', 2010, 3, 22, Decimal('48'), Decimal('871.20000000000004545'), Decimal('4.4000000000000003552'), Decimal('1.5'), Decimal('50.799999999999997158'), Decimal('0.11000000000000000055'), None, 1, 1, 1, 1, 1),
 (134624, '11CEA1', 2010, 2, 17, Decimal('46'), None, Decimal('3.3999999999999999111'), Decimal('2.6000000000000000888'), Decimal('46'), None, None, 0, 0, 0, 0, 0),
 (384010, 'C67A6C', 2010, 3, 24, Decimal('14.400000000000000355'), None, Decimal('4'), Decimal('10.699999999999999289'), Decimal('21.100000000000001421'), None, None, 0, 0, 0, 0, 0),
 (232210, 'DFDF58', 2010, 2, 25, Decimal('-7.2999999999999998223'), None, Decimal('3'), Decimal('10.30000000000000071'), Decimal('-2.2000000000000001776'), None, None, 0, 0, 0, 0, 0)]

What if I want to get all records where year is not equals to 2010. There are two possible ways (!=, or <>) to express inequality. Most database servers such as Mysql, Postgresql, SQLite, etc. support both. However, some database server such as **Microsoft Access and IBM DB2 only support <>**.

In [8]:
%%sql
select * from station_data where year!=2010 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

In [7]:
%%sql
select * from station_data where year<>2010 limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

These two queries do the same thing. You should see the same output.

We can also qualify inclusive ranges using a BETWEEN statement, as shown here
(“inclusive” means that 2005 and 2010 are included in the range):

In [10]:
%%sql
SELECT * FROM station_data
WHERE year BETWEEN 2005 and 2010
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (598550, 'C5C66E', 2006, 10, 15, Decimal('72.900000000000005685'), None, Decimal('14.199999999999999289'), Decimal('1.6999999999999999555'), Decimal('82'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (941830, '229317', 2007, 4, 19, Decimal('66.5'), Decimal('994.89999999999997725'), None, Decimal('4'), Decimal('76.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (932920, 'EB6580', 2009, 5, 17, Decimal('52.100000000000001422'), None, Decimal('12.400000000000000355'), Decimal('7.2999999999999998223'), Decimal('59.399999999999998578'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (985310, 'A79DEC', 2007, 7, 31, Decimal('77.599999999999994316'), None, Decimal('11.80000000000000071'), Decimal('3.3999999999999999111'), Decimal('82.5'), Decimal('0'), None, 0, 0, 0, 0, 0)]

## 2.2 Combining multiple filtering condition

### 2.2.1 And operator

We can express the "between and" range with another expression. For instance the year must be greater than or equal to 2005 and less than or equal to 2010. We need to add two filter and combine the result of the two filter with an **and**.

Below query should return exactly the same result as the above query

In [11]:
%%sql
select * from station_data
where year >= 2005 and year<= 2010
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (598550, 'C5C66E', 2006, 10, 15, Decimal('72.900000000000005685'), None, Decimal('14.199999999999999289'), Decimal('1.6999999999999999555'), Decimal('82'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (941830, '229317', 2007, 4, 19, Decimal('66.5'), Decimal('994.89999999999997725'), None, Decimal('4'), Decimal('76.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (932920, 'EB6580', 2009, 5, 17, Decimal('52.100000000000001422'), None, Decimal('12.400000000000000355'), Decimal('7.2999999999999998223'), Decimal('59.399999999999998578'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (985310, 'A79DEC', 2007, 7, 31, Decimal('77.599999999999994316'), None, Decimal('11.80000000000000071'), Decimal('3.3999999999999999111'), Decimal('82.5'), Decimal('0'), None, 0, 0, 0, 0, 0)]

Note the "between and" express an inclusive range, for not inclusive range, we can not use it. As a result, evaluate the and of two filters become very useful

In [12]:
%%sql
select * from station_data
where year > 2005 and year< 2010
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (598550, 'C5C66E', 2006, 10, 15, Decimal('72.900000000000005685'), None, Decimal('14.199999999999999289'), Decimal('1.6999999999999999555'), Decimal('82'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (941830, '229317', 2007, 4, 19, Decimal('66.5'), Decimal('994.89999999999997725'), None, Decimal('4'), Decimal('76.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (932920, 'EB6580', 2009, 5, 17, Decimal('52.100000000000001422'), None, Decimal('12.400000000000000355'), Decimal('7.2999999999999998223'), Decimal('59.399999999999998578'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (985310, 'A79DEC', 2007, 7, 31, Decimal('77.599999999999994316'), None, Decimal('11.80000000000000071'), Decimal('3.3999999999999999111'), Decimal('82.5'), Decimal('0'), None, 0, 0, 0, 0, 0)]

### 2.2.2 Or operator

The OR operator will return the record if at least one of the criteria is true for the record. For instance, if we wanted only records with months 3, 6, 9, or 12, we can use below query:

In [16]:
%%sql
select * from station_data
where month=3
or month=6
or month=9
or month=12
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (821930, '1F8A7B', 1953, 6, 18, Decimal('72.799999999999997156'), Decimal('1007.1000000000000227'), Decimal('12.400000000000000355'), Decimal('3.6000000000000000888'), Decimal('81.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (478070, 'D028D8', 1981, 6, 27, Decimal('73.400000000000005682'), None, Decimal('7.9000000000000003552'), Decimal('3'), Decimal('77'), Decimal('1.9299999999999999378'), None, 0, 0, 0, 0, 0),
 (471100, '6A6704', 1990, 9, 19, Decimal('50.500000000000000001'), None, Decimal('6'), Decimal('4.0999999999999996447'), Decimal('62.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0)]


### 2.2.3 In operator

In the above example, we tested column month with a list of possible value. In this kind of situation, we can use the **In** operator.

In [15]:
%%sql
select * from station_data
where month in (3,6,9,12)
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (821930, '1F8A7B', 1953, 6, 18, Decimal('72.799999999999997156'), Decimal('1007.1000000000000227'), Decimal('12.400000000000000355'), Decimal('3.6000000000000000888'), Decimal('81.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (478070, 'D028D8', 1981, 6, 27, Decimal('73.400000000000005682'), None, Decimal('7.9000000000000003552'), Decimal('3'), Decimal('77'), Decimal('1.9299999999999999378'), None, 0, 0, 0, 0, 0),
 (471100, '6A6704', 1990, 9, 19, Decimal('50.500000000000000001'), None, Decimal('6'), Decimal('4.0999999999999996447'), Decimal('62.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0)]

We can also express the negation of the in operator by adding not in front of **in** operator.

In [14]:
%%sql
select * from station_data
where month not in (3,6,9,12)
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0),
 (719200, 'C74611', 1978, 2, 5, Decimal('-4.4000000000000003552'), Decimal('962.89999999999997728'), Decimal('14.900000000000000355'), Decimal('13.30000000000000071'), Decimal('1.6000000000000000888'), Decimal('0'), Decimal('9.8000000000000007105'), 0, 0, 0, 0, 0)]

### 2.2.4 Arithmetic operators

We can notice 3,6,9,12 can all be divided by 3. So we can also use another way to get the same records as above examples.


**Note Oracle does not support the modulus operator. It instead uses the MOD() function.**

In [17]:
%%sql
select * from station_data
where month%3=0
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (821930, '1F8A7B', 1953, 6, 18, Decimal('72.799999999999997156'), Decimal('1007.1000000000000227'), Decimal('12.400000000000000355'), Decimal('3.6000000000000000888'), Decimal('81.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (478070, 'D028D8', 1981, 6, 27, Decimal('73.400000000000005682'), None, Decimal('7.9000000000000003552'), Decimal('3'), Decimal('77'), Decimal('1.9299999999999999378'), None, 0, 0, 0, 0, 0),
 (471100, '6A6704', 1990, 9, 19, Decimal('50.500000000000000001'), None, Decimal('6'), Decimal('4.0999999999999996447'), Decimal('62.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0)]

## 2.3 Filtering text columns

The rules for qualifying text fields follow the same structure, although there are subtle(small) differences. You can
**use =, AND, OR, and IN statements with text**. However, when using text, you must wrap literals (or text values you specify) **in single quotes**.

In [18]:
%%sql
SELECT * FROM station_data
WHERE report_code = '513A63'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
1 rows affected.

[(702223, '513A63', 2010, 1, 22, Decimal('-23.100000000000001421'), None, Decimal('10'), Decimal('0.8000000000000000444'), Decimal('-15.599999999999999644'), Decimal('0'), None, 0, 0, 0, 0, 0)]

Note **postgresql does not support double quote** on string value. So below query will return error in postgresql. It works for Mysql or Sqlite

In [19]:
%%sql
SELECT * FROM station_data
WHERE report_code = "513A63"
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
(psycopg2.errors.UndefinedColumn) column "513A63" does not exist
LINE 2: WHERE report_code = "513A63"
                            ^

[SQL: SELECT * FROM station_data
WHERE report_code = "513A63"
limit 5;]
(Background on this error at: https://sqlalche.me/e/14/f405)

If we do not add " or ' on 513A63, the database server will get confused and think 513A63 is a column name rather than a text value. This single-quote rule applies to all text operations. For example, below query will return error.

In [20]:
%%sql
SELECT * FROM station_data
WHERE report_code = 513A63
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
(psycopg2.errors.SyntaxError) syntax error at or near "A63"
LINE 2: WHERE report_code = 513A63
                               ^

[SQL: SELECT * FROM station_data
WHERE report_code = 513A63
limit 5;]
(Background on this error at: https://sqlalche.me/e/14/f405)

We can also use string value in other filter operations. Below query will return all rows that has the three specific report_code.

In [21]:
%%sql
SELECT * FROM station_data
WHERE report_code IN ('513A63','1F8A7B','EF616A');

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
3 rows affected.

[(470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0),
 (821930, '1F8A7B', 1953, 6, 18, Decimal('72.799999999999997156'), Decimal('1007.1000000000000227'), Decimal('12.400000000000000355'), Decimal('3.6000000000000000888'), Decimal('81.299999999999997156'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (702223, '513A63', 2010, 1, 22, Decimal('-23.100000000000001421'), None, Decimal('10'), Decimal('0.8000000000000000444'), Decimal('-15.599999999999999644'), Decimal('0'), None, 0, 0, 0, 0, 0)]

### 2.3.1 Other useful functions

#### filter by using length

**length** operator can get the length of a text field. For instance, all report_code contains six characters or digit. Below query returns all rows that has incorrect report_code.

In [24]:
%%sql
SELECT * FROM station_data
WHERE length(report_code) != 5
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

#### Wild card text filtering with like operator

Another common operation is to use wildcards with LIKE followed by a regular expression, in the regular expression:
- % : means any number of characters an
- _ : means any single character.
- Any other character is interpreted literally.

So, if you wanted to find all report codes that start with the letter “A,” you would run this statement to find “A” followed by any characters

In [26]:
%%sql
select * from station_data
where report_code like 'A%'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(484750, 'A38C90', 1988, 6, 24, Decimal('72.599999999999994316'), None, Decimal('8.6999999999999992894'), Decimal('3.1000000000000000888'), Decimal('87.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (985310, 'A79DEC', 2007, 7, 31, Decimal('77.599999999999994316'), None, Decimal('11.80000000000000071'), Decimal('3.3999999999999999111'), Decimal('82.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (724505, 'A49553', 2005, 4, 28, Decimal('42.70000000000000284'), None, Decimal('6.7999999999999998223'), Decimal('11.199999999999999289'), Decimal('55.399999999999998577'), Decimal('0.41999999999999998445'), None, 0, 0, 0, 0, 0),
 (215350, 'ACE19E', 1991, 4, 9, Decimal('-6.5'), None, Decimal('5.5'), Decimal('25'), Decimal('-3.3999999999999999111'), Decimal('0.020000000000000000416'), Decimal('2.3999999999999999111'), 0, 0, 0, 0, 0),
 (209730, 'A70AAE', 1986, 3, 26, Decimal('-19.80000000000000071'), None, Decimal('8.5'), Decimal('12.099999999999999644'), Decimal('-13.80000000000000071'), Decimal('0.029999999999999998889'), Decimal('4.7000000000000001776'), 0, 0, 0, 0, 0)]

If you wanted all report codes that have a “B” as the first character and a “C” as the third character,

In [28]:
%%sql
select * from station_data
where report_code like 'B_C%'
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(999999, 'B6C2DE', 1966, 2, 8, Decimal('38.799999999999997157'), Decimal('992.8999999999999773'), Decimal('15.199999999999999289'), Decimal('5.5'), Decimal('52.5'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (60110, 'B8CB27', 1997, 1, 20, Decimal('41.700000000000002841'), Decimal('1008.2999999999999545'), Decimal('13.099999999999999644'), Decimal('19.100000000000001421'), Decimal('44.700000000000002843'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0),
 (64080, 'BECB51', 1982, 8, 8, Decimal('59'), None, Decimal('2.5'), Decimal('11'), Decimal('65.500000000000000001'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (973800, 'B8C53F', 2007, 8, 15, Decimal('68.499999999999999999'), Decimal('1011'), Decimal('7.4000000000000003552'), Decimal('7.5'), Decimal('80.500000000000000001'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (319760, 'B1CA98', 1957, 9, 8, Decimal('42.5'), None, None, Decimal('18.5'), Decimal('44.700000000000002843'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

## 2.4 Filtering boolean column

Booleans are true/false values. In the database world, typically **false is expressed as 0 and true is expressed as 1**. Some database platforms **(like MySQL) allow you to implicitly use the words true and false**

**SQLite, however, does not support this. It expects you to explicitly use 1 for true and 0 for false**. For instance, below query gets all records where there was tornado and hail:

In [30]:
%%sql
select * from station_data
where tornado=1 AND hail=1
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (724320, '207979', 1988, 3, 4, Decimal('33.100000000000001421'), Decimal('999.39999999999997726'), Decimal('3.1000000000000000888'), Decimal('9.3000000000000007105'), Decimal('35.10000000000000142'), Decimal('0.23000000000000000999'), None, 1, 1, 1, 1, 1),
 (743920, '2ABE7D', 1996, 5, 21, Decimal('57.60000000000000142'), None, Decimal('5.7999999999999998223'), Decimal('7.5'), Decimal('70'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (724460, 'B9B8B2', 1986, 10, 2, Decimal('64.200000000000002841'), Decimal('976'), Decimal('5.5'), Decimal('6.5'), Decimal('65.400000000000005685'), Decimal('0.60999999999999998667'), None, 1, 1, 1, 1, 1),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1)]

If you are looking for just true values, you do not even have to use the "= 1" expression. Because the fields are already Boolean (behind the scenes,
every **WHERE condition boils down to a Boolean expression**), they inherently qualify by themselves. Hence, you can achieve the same results by running the following query:

In [ ]:
%%sql
select * from station_data
where tornado AND hail;

However, qualifying for false conditions needs to be explicit. To get all records with no tornado but with hail, run this query:

In [ ]:
%%sql
SELECT * FROM station_data
WHERE tornado = 0 AND hail = 1;

You can also use the NOT keyword to qualify tornado as false:

In [ ]:
%%sql
SELECT * FROM station_data
WHERE NOT tornado AND hail;

## 2.5 Handling null

You may have noticed that some columns, such as station_pressure and snow_depth , have null values. **A null is a value that has no value. It is the complete absence of any content. It is a vacuous state**.

In sql, **Null values cannot be determined with an = . You need to use the IS NULL or IS NOT NULL statements to identify null values**

Below query returns all rows that snow_depth is null

In [33]:
%%sql
select * from station_data
where snow_depth is null
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

### 2.5.1 Why we even have null values in the database? Can we replace null by 0 for snow_depth?

The null values is useful for some use case. For example, for column such as snow_depth or precipitation, it does make sense. Not because it was a sunny day (in this case, it is better to record the values as 0), but rather because some stations might not have the necessary instruments to take those measurements. It might be misleading to set those values to 0 (which implies data was recorded), so those measurements should be left null.

In some columns, we can not have null values. For example, the **station_number** column should be designed that it never allows nulls. Because if it's null, all the rest columns of this row become orphan data that belongs to no station.

We can see that nulls values are ambiguous and it can be difficult to determine their business meaning. It is important that nullable columns (columns that are allowed to have null values) **have documented what a null value means from a business perspective**. **Otherwise, nulls should be banned from those table columns**.

Do not confuse nulls with empty text(i.e., '' ). This also applies to whitespace text (i.e., ' ') . These will be treated as values and
never will be considered null. A null is definitely not the same as 0 either, because 0 is a value, whereas null is an absence of a value.

### 2.5.2 Problems caused by null values

We know that precipitation column has null values, try to run the following query. You can notice that the returned rows do not contain any null values. Because null is not 0 or any number, it will not qualify to any condition. So the **precipitation <= 0.5** filtered out all rows that contain null value.

In [35]:
%%sql
SELECT station_number, precipitation FROM station_data
WHERE precipitation <= 0.5
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, Decimal('0')),
 (766440, Decimal('0')),
 (176010, Decimal('0')),
 (125600, Decimal('0')),
 (470160, Decimal('0.040000000000000000832'))]

But having a null value does not mean the precipitation > 0.5, so we may want to keep those rows that have null values. We can have them by using the following query

In [36]:
%%sql
SELECT station_number, precipitation FROM station_data
WHERE precipitation is null
OR precipitation <= 0.5
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, Decimal('0')),
 (766440, Decimal('0')),
 (176010, Decimal('0')),
 (125600, Decimal('0')),
 (470160, Decimal('0.040000000000000000832'))]

The above query works, but we have a more elegant way of handling null values. We can use the **coalesce() function**
- coalesce(col_name,replacement_value): It takes a column name that may have null value, if the row value is null,
  then replace it with the given replacement_value.

Below query use coalesce to replace all null value of column precipitation by 0 than compare them with <=0.5. This will not modify the origin table.

In [38]:
%%sql
SELECT * FROM station_data
WHERE coalesce(precipitation, 0) <= 0.5
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(143080, '34DDA7', 2002, 12, 21, Decimal('33.799999999999997158'), Decimal('987.39999999999997727'), Decimal('3.3999999999999999111'), Decimal('0.2000000000000000111'), Decimal('36'), Decimal('0'), None, 1, 1, 1, 1, 1),
 (766440, '39537B', 1998, 10, 1, Decimal('72.70000000000000284'), Decimal('1014.6000000000000227'), Decimal('5.9000000000000003552'), Decimal('6.7000000000000001776'), Decimal('83.299999999999997154'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (176010, 'C3C6D5', 2001, 5, 18, Decimal('55.700000000000002842'), None, Decimal('7.2999999999999998223'), Decimal('4.2999999999999998223'), Decimal('69.099999999999994317'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (125600, '145150', 2007, 10, 14, Decimal('33'), None, Decimal('6.9000000000000003552'), Decimal('2.5'), Decimal('39.700000000000002843'), Decimal('0'), None, 0, 0, 0, 0, 0),
 (470160, 'EF616A', 1967, 7, 29, Decimal('65.599999999999994313'), None, Decimal('9.1999999999999992894'), Decimal('1.1999999999999999555'), Decimal('72.400000000000005683'), Decimal('0.040000000000000000832'), None, 0, 0, 0, 0, 0)]

If we want the other user can use the replaced value, we can create a new column by using below query

In [39]:
%%sql
SELECT report_code, coalesce(precipitation, 0) as rainfall
FROM station_data
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[('34DDA7', Decimal('0')),
 ('39537B', Decimal('0')),
 ('C3C6D5', Decimal('0')),
 ('145150', Decimal('0')),
 ('EF616A', Decimal('0.040000000000000000832'))]

## 2.6 Grouping Conditions

When you start chaining "AND" and "OR" together, you need to make sure that you organize each set of conditions between each OR in a way that groups related conditions.

For example, we need to find all rows that snow or sleet(rain with snow). For sleet to happen, there must be rain and a temperature less than or equal to 32 degrees. We could write below query.

In [40]:
%%sql
SELECT * FROM station_data
WHERE rain = 1 AND temperature <= 32
OR snow_depth > 0
limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(719200, 'C74611', 1978, 2, 5, Decimal('-4.4000000000000003552'), Decimal('962.89999999999997728'), Decimal('14.900000000000000355'), Decimal('13.30000000000000071'), Decimal('1.6000000000000000888'), Decimal('0'), Decimal('9.8000000000000007105'), 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1),
 (28010, '423D51', 2004, 2, 15, Decimal('23.699999999999999289'), Decimal('953.70000000000004544'), None, Decimal('6.5999999999999996447'), Decimal('26'), Decimal('0.020000000000000000416'), Decimal('26.399999999999998578'), 0, 0, 0, 0, 0),
 (710830, 'FC6047', 2008, 1, 16, Decimal('-13.699999999999999289'), Decimal('990.6000000000000227'), Decimal('0.4000000000000000222'), Decimal('21.899999999999998578'), Decimal('-8.6999999999999992894'), Decimal('0.10000000000000000555'), Decimal('11.400000000000000355'), 0, 0, 0, 0, 0)]

We are lucky this works, because AND, OR have the same priority, sql resolve from left to right. So **rain = 1 AND temperature <= 32** resolved to a value, then this value get resolved with **OR snow_depth > 0**. But for a begginer, this can be confusing, he will wonder if AND condition get resolved first or the OR condition get resolved first.

To avoid this, we can explicitly group conditions in parentheses. This makes not only makes the semantics clearer, but also the execution safer.

In [41]:
%%sql
SELECT * FROM station_data
WHERE (rain = 1 AND temperature <= 32)
OR snow_depth > 0
limit 5

 * postgresql://pliu:***@127.0.0.1:5432/weather_stations
5 rows affected.

[(719200, 'C74611', 1978, 2, 5, Decimal('-4.4000000000000003552'), Decimal('962.89999999999997728'), Decimal('14.900000000000000355'), Decimal('13.30000000000000071'), Decimal('1.6000000000000000888'), Decimal('0'), Decimal('9.8000000000000007105'), 0, 0, 0, 0, 0),
 (29880, '921894', 1986, 12, 26, Decimal('13.900000000000000355'), None, Decimal('6.5999999999999996447'), Decimal('14.699999999999999289'), Decimal('16.80000000000000071'), Decimal('0.020000000000000000416'), Decimal('8.6999999999999992894'), 0, 0, 0, 0, 0),
 (700450, '77D245', 1985, 11, 4, Decimal('-12.199999999999999289'), Decimal('1023.7000000000000454'), Decimal('6.2000000000000001776'), Decimal('16.30000000000000071'), Decimal('-7.2000000000000001776'), Decimal('0'), Decimal('0.8000000000000000444'), 1, 1, 1, 1, 1),
 (28010, '423D51', 2004, 2, 15, Decimal('23.699999999999999289'), Decimal('953.70000000000004544'), None, Decimal('6.5999999999999996447'), Decimal('26'), Decimal('0.020000000000000000416'), Decimal('26.399999999999998578'), 0, 0, 0, 0, 0),
 (710830, 'FC6047', 2008, 1, 16, Decimal('-13.699999999999999289'), Decimal('990.6000000000000227'), Decimal('0.4000000000000000222'), Decimal('21.899999999999998578'), Decimal('-8.6999999999999992894'), Decimal('0.10000000000000000555'), Decimal('11.400000000000000355'), 0, 0, 0, 0, 0)]